---
title: "Pandas: Advanced Techniques for Conditional Filtering and Querying"
author: "Mohammed Adil Siraju"
date: "2025-09-16"
categories: [pandas, dataframe, filtering, querying, data-manipulation]
description: "Master advanced pandas techniques for conditional filtering, boolean indexing, query methods, sorting, and ranking data. Learn efficient data manipulation strategies with practical examples."
---

# Pandas: Advanced Conditional Filtering and Querying Techniques

Welcome to this comprehensive guide on advanced pandas techniques for data filtering and querying! This notebook covers essential skills for working with pandas DataFrames, including conditional filtering, boolean indexing, query methods, sorting, and ranking operations.

## üìã What You'll Learn

- **Conditional Filtering**: Using boolean indexing to filter data based on conditions
- **Query Method**: Writing SQL-like queries on pandas DataFrames  
- **Sorting Techniques**: Multi-column sorting and custom sort orders
- **Ranking Methods**: Different ranking strategies for data analysis
- **Best Practices**: Efficient data manipulation patterns

## üéØ Prerequisites

- Basic pandas knowledge
- Understanding of Python data structures
- Familiarity with DataFrame operations

Let's dive into the advanced filtering techniques!

In [1]:
import pandas as pd

## üìä Setup and Data Loading

First, let's import pandas and load our sample dataset to work with.

In [2]:
df = pd.read_csv('example.csv')
df

    Name  Age      City
0   Adil   23  Matannur
1   Aman   19   Vellore
2   Ziya   15       Tly
3  Zahra    9       Knr

## üîç Conditional Filtering with Boolean Indexing

Boolean indexing allows you to filter DataFrames based on conditions. This is one of the most powerful features of pandas for data manipulation.

### Basic Boolean Filtering

Let's start with simple conditional filtering using comparison operators.

In [3]:
df[df['Age'] < 20]

    Name  Age     City
1   Aman   19  Vellore
2   Ziya   15      Tly
3  Zahra    9      Knr

### Simple Condition: Filter by Age

Filter rows where Age is less than 20:

In [5]:
df[(df['City']=='Vellore') | (df['Age']<20)]

    Name  Age     City
1   Aman   19  Vellore
2   Ziya   15      Tly
3  Zahra    9      Knr

### OR Condition: Multiple Criteria (Either condition true)

Filter rows where City is 'Vellore' OR Age is less than 20:

In [6]:
df[(df['City']=='Vellore') & (df['Age']<20)]

   Name  Age     City
1  Aman   19  Vellore

### AND Condition: Multiple Criteria (All conditions true)

Filter rows where City is 'Vellore' AND Age is less than 20:

In [8]:
df.query('Age > 10')

   Name  Age      City
0  Adil   23  Matannur
1  Aman   19   Vellore
2  Ziya   15       Tly

## üîé Query Method: SQL-like Filtering

The `.query()` method provides a more readable way to filter DataFrames using SQL-like syntax. It's often cleaner than boolean indexing for complex conditions.

### Basic Query Syntax

Query rows where Age is greater than 10:

In [12]:
df.query("Age > 10 and City == 'Matannur'")

   Name  Age      City
0  Adil   23  Matannur

### Query with AND Condition

Query rows where Age > 10 AND City equals 'Matannur':

In [15]:
df.query("Age < 18 or City == 'Matannur'")

    Name  Age      City
0   Adil   23  Matannur
2   Ziya   15       Tly
3  Zahra    9       Knr

### Query with OR Condition

Query rows where Age < 18 OR City equals 'Matannur':

In [20]:
df.query("Age * 2 > 30")

   Name  Age      City
0  Adil   23  Matannur
1  Aman   19   Vellore

### Query with Mathematical Operations

Query with mathematical expressions - rows where Age * 2 > 30:

## üîÑ Sorting Data

Sorting is essential for data analysis. Pandas provides flexible sorting capabilities for both single and multiple columns.

### Basic Sorting by Single Column

Sort by Age in descending order:

In [21]:
df

    Name  Age      City
0   Adil   23  Matannur
1   Aman   19   Vellore
2   Ziya   15       Tly
3  Zahra    9       Knr

In [23]:
df.sort_values('Age',ascending=False)

    Name  Age      City
0   Adil   23  Matannur
1   Aman   19   Vellore
2   Ziya   15       Tly
3  Zahra    9       Knr

In [26]:
df.sort_values(['Name', 'Age'],ascending=True)

    Name  Age      City
0   Adil   23  Matannur
1   Aman   19   Vellore
3  Zahra    9       Knr
2   Ziya   15       Tly

### Multi-Column Sorting

Sort by Name first (ascending), then by Age (ascending) for ties:

## üèÜ Ranking Data

Ranking assigns ordinal numbers to data points. This is useful for competitions, percentiles, and comparative analysis.

### Default Ranking (Average method)

Rank ages - ties get average rank:

In [29]:
df

    Name  Age      City
0   Adil   23  Matannur
1   Aman   19   Vellore
2   Ziya   15       Tly
3  Zahra    9       Knr

In [27]:
df['Age'].rank()

0    4.0
1    3.0
2    2.0
3    1.0
Name: Age, dtype: float64

In [31]:
df['Age'].rank(method='min')

0    4.0
1    3.0
2    2.0
3    1.0
Name: Age, dtype: float64

## üéâ Summary

You've now learned advanced pandas techniques for:

- **Conditional Filtering**: Using boolean indexing with `&` (AND) and `|` (OR) operators
- **Query Method**: Writing SQL-like queries with `.query()` for cleaner, more readable code
- **Sorting**: Single and multi-column sorting with `sort_values()`
- **Ranking**: Different ranking methods for comparative analysis

### Key Takeaways

1. **Boolean Indexing**: `df[condition]` is powerful but can get complex with multiple conditions
2. **Query Method**: `df.query('condition')` is more readable for complex filtering
3. **Sorting**: Use `sort_values()` with lists for multi-column sorting
4. **Ranking**: Choose ranking method based on your analysis needs (average, min, max, etc.)

### Next Steps

- Practice with real datasets
- Combine filtering with other pandas operations
- Explore advanced query features with variables
- Learn about method chaining for efficient data pipelines

Happy pandas coding! üêº

### Ranking with 'min' Method

Rank ages - ties get minimum rank: